order_service/app/controllers/orders_controller.rb

    def create
        @order = Order.find_or_initialize_by(user_id: @current_user_id,status: 'CART')
        @line_item = @order.line_items.find_by_product_id(params[:product_id])

        if @line_item
            @line_item.update({quantity: @line_item.quantity+params[:quantity].to_i})
        else
            @order.line_items.build({product_id: params[:product_id], quantity: params[:quantity],price: params[:price] })
        end

        if @order.save
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."status" = $2 LIMIT $3  [["user_id", 1], ["status", "CART"], ["LIMIT", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = $1 AND "line_items"."product_id" = $2 LIMIT $3  [["order_id", 1], ["product_id", 20], ["LIMIT", 1]]
UPDATE "orders" SET "total_price" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["total_price", "100.0"], ["updated_at", "2023-11-29 07:17:40.405941"], ["id", 1]]
UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 1], ["updated_at", "2023-11-29 09:41:40.654203"], ["id", 6]]
INSERT INTO "orders" ("status", "user_id", "total_price", "guest_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["status", "CART"], ["user_id", 1], ["total_price", nil], ["guest_id", nil], ["created_at", "2023-11-29 07:17:40.343563"], ["updated_at", "2023-11-29 07:17:40.343563"]]
INSERT INTO "line_items" ("order_id", "product_id", "quantity", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["order_id", 1], ["product_id", 20], ["quantity", 1], ["price", "58.0"], ["created_at", "2023-11-29 09:07:48.035158"], ["updated_at", "2023-11-29 09:07:48.035158"]]

    def index
        @orders = Order.find_by(user_id: @current_user_id, status: 'CART')
        line_item = @orders.line_items
        response = []

        line_item.each do |item|
            product = HTTParty.get("http://localhost:3002/product/#{item.product_id}",headers: {Authorization: "Bearer #{@token}"} )
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."status" = $2 LIMIT $3  [["user_id", 1], ["status", "CART"], ["LIMIT", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = $1  [["order_id", 1]]
SELECT "line_items"."product_id" FROM "line_items" WHERE "line_items"."order_id" = $1  [["order_id", 1]]

    def update
        @order = Order.find_by(user_id: @current_user_id, status: 'CART')
        if @order
            @line_item = @order.line_items.find_by_product_id(params[:product_id])
            if @line_item
                @line_item.update(line_item_update_params)
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."status" = $2 LIMIT $3  [["user_id", 1], ["status", "CART"], ["LIMIT", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = $1 AND "line_items"."product_id" = $2 LIMIT $3  [["order_id", 1], ["product_id", 10], ["LIMIT", 1]]
UPDATE "orders" SET "total_price" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["total_price", "160.0"], ["updated_at", "2023-11-29 09:24:31.567892"], ["id", 1]]
UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 2], ["updated_at", "2023-11-29 09:24:31.523268"], ["id", 6]]

    def destroy
        @order = Order.find_by(user_id: @current_user_id, status: 'CART')
        if @order
            @line_item = @order.line_items.find_by_product_id(params[:product_id])
            if @line_item.destroy
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."status" = $2 LIMIT $3  [["user_id", 1], ["status", "CART"], ["LIMIT", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = $1 AND "line_items"."product_id" = $2 LIMIT $3  [["order_id", 1], ["product_id", 20], ["LIMIT", 1]]
DELETE FROM "line_items" WHERE "line_items"."id" = $1  [["id", 2]]