auth_service/app/controllers/authentications_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["email", "shashank@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-11-22 10:34:44.764919"], ["updated_at", "2023-11-22 10:34:44.764919"]]
---
  def register
    user = User.new(user_params)
    if user.save