product_service/app/controllers/product_controller.rb

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "jeans"], ["description", "clothing weare for mens and womens"], ["price", 100], ["created_at", "2023-11-24 05:19:08.532302"], ["updated_at", "2023-11-24 05:19:08.532302"]]
---
  def create
   @product = Product.new(product_params)
   attach_image if product_params[:images]
    if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    @product = Product.find_by(id: params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 37]]
---
  def destroy
    product = Product.find_by(id: params[:id])
    if product
      product.destroy

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "products" SET "name" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["name", "updated name"], ["updated_at", "2023-11-24 05:49:08.263924"], ["id", 3]]
---
  def update
    product = Product.find_by(id: params[:id])
    if product
      product.update(product_params)