order_service/app/models/line_item.rb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = $1  [["order_id", 1]]
UPDATE "orders" SET "total_price" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["total_price", "100.0"], ["updated_at", "2023-11-29 07:17:40.405941"], ["id", 1]]
---
  def update_total_price
    updated_total_price = self.order.line_items.sum { |line_item| line_item.price * line_item.quantity }
    self.order.update(total_price: updated_total_price)